// -------------------------//
//2array
// -------------------------//

let fruits_colors = [
  ['apple','りんご','orange','みかん'],
  ['pink','ピンク','red','赤']
];

console.log(fruits_colors);
console.log(fruits_colors[0]);
console.log(fruits_colors[1]);

// -------------------------//
//3array
// -------------------------//


// let array = [
//   {
//       HP: 250,
//       MP: 30,
//       attack: [
//         '攻撃',
//         '必殺技',
//         '逃げる'
//     ],
//   }
// ];

// console.log(array);

// -------------------------//
// 4array
// -------------------------//


let array4 = [
  {
    HP: 250,
    MP: 30,
    attack: [
      {
        '攻撃': '必殺技',
        '逃げる': [
          'ダッシュ', 'かわす'
        ],
      },
    ],
  },
];

console.log(array4);

// -------------------------//
// 5array
// -------------------------//


let array5 = [
  {
    HP: 250,
    MP: 30,
    attack: [
      {
        '攻撃': '必殺技',
        '逃げる': [
          {
          'ダッシュ':[
            {
          '体力消費' , '転倒'
          }
            ],
           'かわす':[
             {
            '逃げ切る' , '捕まる'
           }
          ],
         }
        ],
      },
    ],
  },
];

console.log(array5);